<!DOCTYPE html>
<html lang="fr">
    <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <title>Left 4 Dead 2 - Nevenkebla</title>
        <script src="https://kit.fontawesome.com/a44d991d57.js" crossorigin="anonymous"></script>
        <link href="https://unpkg.com/aos@2.3.1/dist/aos.css" rel="stylesheet"> <!--Les animations de scroll-->
        <link rel="preconnect" href="https://fonts.googleapis.com">
        <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
        <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@1,700&family=Roboto&family=Taviraj:wght@300&display=swap" rel="stylesheet"> <!--La police google font-->
        <link rel="icon" href="../img/LogoFond.png" type="image/png"/>
        <link rel="stylesheet" href="../css/style.css">
    </head>
    <body>
        <header>
            <div class="langs">
                <a href="#" class="lang">
                    <img src="../img/France.png" alt="Drapeau France">
                    <p>Fran&ccedil;ais</p> 
                </a>
                <a href="../en/realisation/left-4-dead-2" class="lang">
                    <img src="../img/English.png" alt="Drapeau United-States">
                    <p>English</p>
                </a>
            </div>
            <nav>
                <div class="logo">
                    <a href="../index"><img src="../img/Logo.png" alt="Logo de Nevenkebla"></a>
                </div>
                <div class="toggle">
                    <i class="fas fa-bars ouvrir"></i>
                    <i class="fas fa-times fermer"></i>
                </div>
                <ul class="menu">
                    <li><a href="../index" class="menu-lien">Accueil</a></li>
                    <li><a href="../realisations" class="menu-lien">R&eacute;alisations</a></li>
                </ul> 
            </nav>
        </header>
        <section class="real">
            <div class="container">
                <div class="real-corps"> 
                    <div class="real-corps-block">
                        <img src="../img/MiniaLeft4Dead2.png" alt="Miniature Left 4 Dead 2" class="minia">
                    </div>
                    <div class="real-corps-block">
                        <h1>Conception de niveaux — Left 4 Dead 2</h1>
                        <p> 
                            Dans le cadre de ma licence professionnelle, 
                            il nous &eacute;tait demand&eacute; de cr&eacute;er, en groupe de trois ou quatre personnes, 
                            une campagne pour le jeu <span class="italique">Left 4 Dead 2</span>. 
                            J'&eacute;tais en groupe avec <a href="https://adrigollum.github.io/Portfolio/" target="_blank">Adrien Chateau</a> 
                            et <a href="http://elwan-saillant.com/" target="_blank">Elwan Saillant</a>, 
                            et j'ai &eacute;t&eacute; charg&eacute; de concevoir la premi&egrave;re mission de la campagne. 
                            Ayant r&eacute;cemment termin&eacute; les deux jeux de la s&eacute;rie avec des amis 
                            (vous pouvez d'ailleurs retrouver des moments forts et de courts extraits de ces sessions sur mes r&eacute;seaux sociaux), 
                            je disposais d&eacute;j&agrave; d'une bonne base et d'une connaissance approfondie des m&eacute;caniques et des possibilit&eacute;s du jeu. 
                            Ces connaissances m'ont permis de mieux g&eacute;rer la conception des niveaux, des objets &agrave; collecter, 
                            ainsi que des interactions entre les personnages. 
                        </p>
                        <p>
                            Nous avions d&eacute;cid&eacute; de situer notre niveau &agrave; Paris. 
                            Nous voulions &eacute;galement que notre campagne commence par un passage sur l'une des lignes de m&eacute;tro a&eacute;rien de la ville. 
                            La campagne se terminait par un sauvetage du groupe en plein milieu d'un stade. 
                            Il nous fallait donc trouver une zone de Paris respectant au mieux ces contraintes. 
                            C'est ainsi que nous avons choisi le stade Charl&eacute;ty, situ&eacute; non loin de la station Place d'Italie. 
                            Cette station est desservie par la ligne 6, l'une des lignes de m&eacute;tro a&eacute;rien de Paris. 
                            Le m&eacute;tro a&eacute;rien de la premi&egrave;re mission devait &ecirc;tre d&eacute;raill&eacute; sur la voie, 
                            permettant ainsi aux survivants de poursuivre leur progression &agrave; pied dans la rue.
                        </p>
                    </div>
                    <div class="real-corps-block" id="asset2">
                        <img src="../img/Left4Dead2.png" alt="Photo Station Glaci&egrave;re">
                        <img src="../img/Left4Dead22.png" alt="Photo Boulevard">
                    </div>
                    <div class="real-corps-block">
                        <p>
                            <span class="gras">Pitch :</span> <br>
                            Le groupe de survivants avait &eacute;tabli son campement dans la station "Glaci&egrave;re", 
                            mais leurs r&eacute;serves de nourriture commen&ccedil;aient &agrave; s'&eacute;puiser. 
                            C'est alors qu'ils entendent un message radio annon&ccedil;ant une &eacute;vacuation depuis le stade Charl&eacute;ty. 
                            Le groupe d&eacute;cide donc de s'y rendre en empruntant les rails de m&eacute;tro d&eacute;saffect&eacute;s, 
                            qu'ils estiment &ecirc;tre le chemin le plus rapide et le plus s&ucirc;r. 
                            En chemin, ils doivent passer par le centre commercial Italie 2 pour se ravitailler en provisions et, 
                            si possible, trouver un moyen de locomotion plus rapide.
                        </p>
                        <p>
                            Au d&eacute;part, la premi&egrave;re partie de la campagne devait se d&eacute;rouler enti&egrave;rement dans le m&eacute;tro. 
                            Cependant, cette id&eacute;e a &eacute;t&eacute; abandonn&eacute;e pour se rapprocher davantage de la r&eacute;alit&eacute;. 
                            Ayant termin&eacute; les deux jeux de la franchise *Left 4 Dead*, je connaissais bien la structure des niveaux. 
                            Dans ces jeux, les transitions entre les environnements int&eacute;rieurs et ext&eacute;rieurs sont fr&eacute;quentes. 
                            J'ai donc d&eacute;cid&eacute; de suivre cette approche pour mon niveau. 
                            Les personnages alternent ainsi entre des passages &agrave; l'int&eacute;rieur de b&acirc;timents et de moyens de transport, 
                            et des passages dans la rue.
                        </p>
                        <p>
                            Les infect&eacute;s sp&eacute;ciaux sont tous plac&eacute;s dans des zones o&ugrave; ils peuvent exploiter au mieux leurs capacit&eacute;s. 
                            La mise en sc&egrave;ne des &eacute;l&eacute;ments du niveau a &eacute;t&eacute; con&ccedil;ue pour que les joueurs comprennent rapidement et facilement le chemin &agrave; suivre, 
                            que ce soit par les dialogues entre les personnages ou par la disposition des diff&eacute;rents &eacute;l&eacute;ments. 
                            Par exemple, pour indiquer aux joueurs qu'ils doivent entrer dans un b&acirc;timent pour progresser, 
                            des phares de voitures &eacute;clairent la porte d'entr&eacute;e. <br>
                            <span class="sousligne">Logiciel utilis&eacute; :</span><br> 
                        </p>
                        <div class="outils">
                            <img src="../img/AdobePhotoshop.png" alt="Photoshop Logo">
                        </div>
                        <p> Document pdf : <br>
                            <a href="../doc/Diallo_Aboubacar_Left4Dead2.pdf"><button class="btn"> Level Design Document </button></a>
                        </p>
                    </div>
                    <div class="real-corps-block" id="retour">
                        <a href="../realisations">
                            <button class="btn"><i class="fa fa-arrow-left"></i> R&eacute;alisations</button>
                        </a>
                    </div>
                </div>
            </div>
        </section>
        <footer>
            <ul class="copy"> 
                <li>© 2025 Diallo Aboubacar | Tous droits r&eacute;serv&eacute;s.</li> 
                <li><a href="../mentions-legales">Mentions L&eacute;gales</a></li>
            </ul>
        </footer>
        <script src="https://unpkg.com/aos@2.3.1/dist/aos.js"></script> <!--Pour les animations de scroll-->
        <script>
            AOS.init();
        </script>
        <script src="https://cdnjs.cloudflare.com/ajax/libs/gsap/3.8.0/gsap.min.js" 
        integrity="sha512-eP6ippJojIKXKO8EPLtsUMS+/sAGHGo1UN/38swqZa1ypfcD4I0V/ac5G3VzaHfDaklFmQLEs51lhkkVaqg60Q==" 
        crossorigin="anonymous" referrerpolicy="no-referrer"></script>
        <script src="../js/app.js"></script>
    </body>
</html>