<!DOCTYPE html>
<html lang="fr">
    <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <title>Uncharted - Nevenkebla</title>
        <script src="https://kit.fontawesome.com/a44d991d57.js" crossorigin="anonymous"></script>
        <link href="https://unpkg.com/aos@2.3.1/dist/aos.css" rel="stylesheet"> <!--Les animations de scroll-->
        <link rel="preconnect" href="https://fonts.googleapis.com">
        <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
        <link href="https://fonts.googleapis.com/css2?family=Open+Sans:ital,wght@1,700&family=Roboto&family=Taviraj:wght@300&display=swap" rel="stylesheet"> <!--La police google font-->
        <link rel="icon" href="../img/LogoFond.png" type="image/png"/>
        <link rel="stylesheet" href="../css/style.css">
    </head>
    <body>
        <header>
            <div class="langs">
                <a href="#" class="lang">
                    <img src="../img/france.png" alt="Drapeau France">
                    <p>Fran&ccedil;ais</p> 
                </a>
                <a href="../en/realisation/uncharted" class="lang">
                    <img src="../img/english.png" alt="Drapeau United-States">
                    <p>English</p>
                </a>
            </div>
            <nav>
                <div class="logo">
                    <a href="../index"><img src="../img/Logo.png" alt="Logo de Nevenkebla"></a>
                </div>
                <div class="toggle">
                    <i class="fas fa-bars ouvrir"></i>
                    <i class="fas fa-times fermer"></i>
                </div>
                <ul class="menu">
                    <li><a href="../index" class="menu-lien">Accueil</a></li>
                    <li><a href="../realisations" class="menu-lien">R&eacute;alisations</a></li>
                </ul> 
            </nav>
        </header>
        <section class="real">
            <div class="container">
                <div class="real-corps"> 
                    <div class="real-corps-block">
                        <img src="../img/real-uncharted.png" alt="Image Niveau Uncharted">
                    </div>
                    <div class="real-corps-block">
                        <h1>Conception de niveaux — Uncharted</h1>
                        <p> 
                            Dans le cadre de ma licence professionnelle, 
                            il &eacute;tait n&eacute;cessaire de cr&eacute;er deux niveaux pour un jeu d'action-aventure. 
                            Ayant r&eacute;cemment termin&eacute; plusieurs jeux, je me suis inspir&eacute; de la franchise <span class="italique">Uncharted</span>. 
                            L’objectif &eacute;tait de concevoir un niveau d’infiltration et un niveau de combat. 
                            Apr&egrave;s avoir r&eacute;fl&eacute;chi aux diff&eacute;rents jeux de la s&eacute;rie, 
                            j’ai remarqu&eacute; que l’univers asiatique n’&eacute;tait pas beaucoup exploit&eacute;. 
                            J’ai donc entrepris des recherches pour trouver des structures anciennes qui pourraient servir de cadre &agrave; ces niveaux. 
                        </p>
                        <p>
                            C’est ainsi que j’ai d&eacute;couvert la structure sous-marine de Yonaguni, 
                            situ&eacute;e &agrave; l’extr&eacute;mit&eacute; sud de l’&icirc;le du m&ecirc;me nom, 
                            dans l’archipel japonais des Ry&umacr;ky&umacr;. 
                            J’ai puis&eacute; mon inspiration dans cette d&eacute;couverte pour cr&eacute;er mon niveau de combat et d&eacute;finir l’objectif de Nathan. 
                            Pendant mes recherches, j’ai &eacute;galement d&eacute;couvert des l&eacute;gendes et mythes japonais, 
                            comme celui d’Amaterasu, qui s’est enferm&eacute;e dans une grotte apr&egrave;s un diff&eacute;rend avec son fr&egrave;re Susanoo. 
                            J’ai alors pens&eacute; qu’une grotte serait un excellent choix pour une zone d’infiltration.
                        </p>
                    </div>
                    <div class="real-corps-block" id="asset">
                        <img src="../img/unchartedamaterasu.png" alt="Image Amaterasu">
                        <img src="../img/unchartedyonaguni.png" alt="Image Yonaguni">
                    </div>
                    <div class="real-corps-block">
                        <p>
                            Le choix d’un niveau dans une grotte m’a sembl&eacute; logique pour atteindre une structure sous-marine. 
                            La grotte comporte plusieurs niveaux de hauteur. 
                            Pour maintenir une coh&eacute;rence sous-marine, les zones les plus basses sont inond&eacute;es. 
                            Nathan doit donc nager pour traverser ces zones. 
                            Les zones plus &eacute;lev&eacute;es, quant &agrave; elles, 
                            sont occup&eacute;es par les ennemis les plus importants du niveau. 
                            Partout dans le niveau, des objets collectables li&eacute;s &agrave; l’histoire de la zone sont dispers&eacute;s. 
                            &Eacute;tant donn&eacute; qu’il s’agit d’un niveau d’infiltration, 
                            de nombreuses structures et objets ont &eacute;t&eacute; plac&eacute;s pour permettre &agrave; Nathan de se cacher des patrouilles ennemies.
                        </p>
                        <p>
                            Avant d’arriver au temple, 
                            Nathan doit traverser un passage souterrain en nageant et en grimpant le long de parois glissantes. 
                            Une fois arriv&eacute; dans le temple, 
                            Nathan laisse son &eacute;quipement de plong&eacute;e et doit r&eacute;soudre une &eacute;nigme : 
                            trouver un moyen d’&eacute;quilibrer le niveau d’eau de chaque bassin. 
                            Apr&egrave;s avoir r&eacute;solu l’&eacute;nigme et r&eacute;cup&eacute;r&eacute; l’artefact, 
                            le temple est pris d’assaut par ses ennemis. 
                            Cela cause des d&eacute;g&acirc;ts irr&eacute;versibles au temple, 
                            qui commence &agrave; s’&eacute;crouler et &agrave; se remplir d’eau.
                        </p>
                        <p>
                            Nathan doit alors s’&eacute;chapper du temple tout en se frayant un chemin &agrave; travers les ennemis pour r&eacute;cup&eacute;rer son mat&eacute;riel de plong&eacute;e. 
                            Son chemin d’arriv&eacute;e &eacute;tant compl&egrave;tement bloqu&eacute; &agrave; cause des &eacute;croulements, 
                            de nouveaux passages se cr&eacute;ent gr&acirc;ce aux statues et autres d&eacute;bris effondr&eacute;s. 
                            Nathan r&eacute;ussit &agrave; r&eacute;cup&eacute;rer son mat&eacute;riel et &agrave; &eacute;chapper aux ennemis, 
                            mais cela n’emp&ecirc;che pas le temple de s’effondrer compl&egrave;tement et d’&ecirc;tre enti&egrave;rement inond&eacute;. 
                            Nathan est finalement secouru &agrave; la surface par son ami de toujours, Sully. <br>
                            <span class="sousligne">Logiciel utilis&eacute; :</span><br>
                        </p>
                        <div class="outils">
                            <img src="../img/adobe-photoshop.png" alt="Photoshop Logo">
                        </div>
                        <p> Documents pdf : <br>
                            <a href="../doc/Diallo_Aboubacar_BubbleDiagram_Uncharted.pdf"><button class="btn"> Bubble Diagram LDD</button></a>
                            <a href="../doc/Diallo_Aboubacar_Croquis_Uncharted.pdf"><button class="btn"> Croquis LDD</button></a>
                        </p>
                    </div>
                    <div class="real-corps-block" id="retour">
                        <a href="../realisations">
                            <button class="btn"><i class="fa fa-arrow-left"></i> R&eacute;alisations</button>
                        </a>
                    </div>
                </div>
            </div>
        </section>
        <footer>
            <ul class="copy"> 
                <li>© 2024 Diallo Aboubacar | Tous droits r&eacute;serv&eacute;s.</li> 
                <li><a href="../mentionslegales">Mentions L&eacute;gales</a></li>
            </ul>
        </footer>
        <script src="https://unpkg.com/aos@2.3.1/dist/aos.js"></script> <!--Pour les animations de scroll-->
        <script>
            AOS.init();
        </script>
        <script src="https://cdnjs.cloudflare.com/ajax/libs/gsap/3.8.0/gsap.min.js" 
        integrity="sha512-eP6ippJojIKXKO8EPLtsUMS+/sAGHGo1UN/38swqZa1ypfcD4I0V/ac5G3VzaHfDaklFmQLEs51lhkkVaqg60Q==" 
        crossorigin="anonymous" referrerpolicy="no-referrer"></script>
        <script src="../js/app.js"></script>
    </body>
</html>